# numbers = [1, 2, 3]
# print(numbers)

# numbers = []
# numbers.append("10")
# print(numbers)

# Дан список [5, 10, 15]. Выведите его длину.
# my_list = [5, 10, 15]
# list_length = len(my_list)
# print(list_length)

# Дан список ['a', 'b', 'c']. Выведите второй элемент списка.  
# my_list = ['a', 'b', 'c']
# print(my_list[1])

# Создайте список из двух строк: "привет" и "мир". Объедините их в одну строку 
# через пробел, используя элементы списка.  
# list1 = ["Привет", "мир"]
# print(list1)

# 6. Добавьте число 100 в конец списка [1, 2, 3]. Выведите получившийся список.
# my_list =  [1, 2, 3] 
# my_list.append(100)
# print(my_list)

# 7.Удалите последний элемент из списка [10, 20, 30, 40]. Выведите оставшийся список.  
# my_list = [10, 20, 30, 40]
# my_list.pop()
# print(my_list)

# 8. Проверьте, содержится ли число 7 в списке [1, 3, 5, 7, 9]. Выведите True или False.
# my_list = [1, 3, 5, 7, 9]

# print(7 in my_list)

# 9. Создайте список из пяти нулей. Выведите его.  
# my_list = [0, 0, 0, 0, 0]
# print(my_list)


# 10 Дан список [1, 2, 3, 4, 5]. Выведите первый и последний элементы.   
# my_list = [1, 2, 3, 4, 5]
# print(a[0], a[-1])